`Customer Analytics: Preparing Data for Modeling`

`August 2025`

This project focuses on optimizing the memory usage of a large customer dataset by transforming data types and filtering records. The goal is to enable more efficient modeling and analysis, ultimately improving the performance of predictive models used for student job placement.

`Any questions, please reach out!`

Chiawei Wang, PhD\
Data & Product Analyst\
<chiawei.w@outlook.com>

`*` Note that the table of contents and other links may not work directly on GitHub.

[Table of Contents](#table-of-contents)
1. [Executive Summary](#executive-summary)
   - [Challenge](#challenge)
   - [Objectives](#objectives)
   - [Data Overview](#data-overview)
   - [Approach](#approach)
   - [Results](#results)
   - [Conclusion](#conclusion)
2. [Exploratory Data Analysis](#exploratory-data-analysis)

# Executive Summary

## Challenge

We want to optimize the memory usage of a large customer dataset by transforming data types and filtering records. This will enable more efficient modeling and analysis, ultimately improving the performance of predictive models used for student job placement.

## Objectives

- Convert columns to appropriate data types to reduce memory usage.
- Filter the dataset to include only relevant records based on experience and company size.

## Data Overview

| Index | Column                   | Type     | Description                                                                 |
| ----- | ------------------------ | -------- | --------------------------------------------------------------------------- |
| 0     | `student_id`             | int64    | A unique ID for each student                                                |
| 1     | `city`                   | category | A code for the city the student lives in                                    |
| 2     | `city_development_index` | float64  | A scaled development index for the city                                     |
| 3     | `gender`                 | category | The student's gender                                                        |
| 4     | `relevant_experience`    | bool     | An indicator of the student's work relevant experience                      |
| 5     | `enrolled_university`    | category | The type of university course enrolled in (if any)                          |
| 6     | `education_level`        | category | The student's education level                                               |
| 7     | `major_discipline`       | category | The educational discipline of the student                                   |
| 8     | `experience`             | category | The student's total work experience (in years)                              |
| 9     | `company_size`           | category | The number of employees at the student's current employer                   |
| 10    | `company_type`           | category | The type of company employing the student                                   |
| 11    | `last_new_job`           | category | The number of years between the student's current and previous jobs         |
| 12    | `training_hours`         | int64    | The number of hours of training completed                                   |
| 13    | `job_change`             | bool     | An indicator of whether the student is looking for a new job (1) or not (0) |

## Approach

1. Exploratory data analysis
2. Converting integers, floats, and unordered categories
3. Converting ordered categories
4. Filtering on ordered categorical columns

## Results

- **Memory reduction**: The overall memory footprint of the dataset has been decreased by approximately 30% after converting data types and filtering records.
- **Data integrity**: Careful consideration was given to ensure that data integrity was maintained throughout the optimization process.
- **Relevant subset**: The filtered dataset now focuses on students with relevant experience and those from companies of a certain size, making it more suitable for analysis.

## Conclusion

The project successfully achieved its goals of reducing memory usage and focusing on a relevant subset of students. These improvements will facilitate more efficient modeling and analysis, ultimately enhancing the performance of predictive models used for student job placement.

# Exploratory Data Analysis

In [1]:
# Import necessary libraries
import pandas as pd

In [2]:
# Read in the CSV as a DataFrame
df = pd.read_csv('customers.csv')

# Preview the data
print(df.shape)
df.head()

(19158, 14)

,student_id,city,city_development_index,gender,relevant_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,job_change
0,8949,city_103,0.920,Male,Has relevant experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,29725,city_40,0.776,Male,No relevant experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,11561,city_21,0.624,NaN,No relevant experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,33241,city_115,0.789,NaN,No relevant experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
4,666,city_162,0.767,Male,Has relevant experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0

In [3]:
# EDA to help identify ordinal, nominal, and two-factor categories
for col in df.select_dtypes('object').columns:
    print(df[col].value_counts())
    print()

city
city_103    4355
city_21     2702
city_16     1533
city_114    1336
city_160     845
            ...
city_129       3
city_111       3
city_121       3
city_140       1
city_171       1
Name: count, Length: 123, dtype: int64

gender
Male      13221
Female     1238
Other       191
Name: count, dtype: int64

relevant_experience
Has relevant experience    13792
No relevant experience      5366
Name: count, dtype: int64

enrolled_university
no_enrollment       13817
Full time course     3757
Part time course     1198
Name: count, dtype: int64

education_level
Graduate          11598
Masters            4361
High School        2017
Phd                 414
Primary School      308
Name: count, dtype: int64

major_discipline
STEM               14492
Humanities           669
Other                381
Business Degree      327
Arts                 253
No Major             223
Name: count, dtype: int64

experience
>20    3286
5      1430
4      1403
3      1354
6      1216
2      1127
7      1028
10      985
9       980
8       802
15      686
11      664
14      586
1       549
<1      522
16      508
12      494
13      399
17      342
19      304
18      280
20      148
Name: count, dtype: int64

company_size
50-99        3083
100-499      2571
10000+       2019
10-49        1471
1000-4999    1328
<10          1308
500-999       877
5000-9999     563
Name: count, dtype: int64

company_type
Pvt Ltd                9817
Funded Startup         1001
Public Sector           955
Early Stage Startup     603
NGO                     521
Other                   121
Name: count, dtype: int64

last_new_job
1        8040
>4       3290
2        2900
never    2452
4        1029
3        1024
Name: count, dtype: int64

In [4]:
# Create a dictionary of columns containing ordered categorical data
ordered_cats = {
    'enrolled_university': ['no_enrollment', 'Part time course', 'Full time course'],
    'education_level': ['Primary School', 'High School', 'Graduate', 'Masters', 'Phd'],
    'experience': ['<1'] + list(map(str, range(1, 21))) + ['>20'],
    'company_size': ['<10', '10-49', '50-99', '100-499', '500-999', '1000-4999', '5000-9999', '10000+'],
    'last_new_job': ['never', '1', '2', '3', '4', '>4']
}

# Create a mapping dictionary of columns containing two-factor categories to convert to Booleans
two_factor_cats = {
    'relevant_experience': {'No relevant experience': False, 'Has relevant experience': True},
    'job_change': {0.0: False, 1.0: True}
}

# Loop through DataFrame columns to efficiently change data types
for col in df:
    
    # Convert two-factor categories to bool
    if col in ['relevant_experience', 'job_change']:
        df[col] = df[col].map(two_factor_cats[col])

    # Convert integer columns to int64
    elif col in ['student_id', 'training_hours']:
        df[col] = df[col].astype('int64')

    # Convert float columns to float64
    elif col == 'city_development_index':
        df[col] = df[col].astype('float64')

    # Convert columns containing ordered categorical data to ordered categories using dict
    elif col in ordered_cats.keys():
        category = pd.CategoricalDtype(ordered_cats[col], ordered = True)
        df[col] = df[col].astype(category)

    # Convert remaining columns to standard categories
    else:
        df[col] = df[col].astype('category')

# Preview the updated DataFrame
print(df.shape)
df.head()

(19158, 14)

,student_id,city,city_development_index,gender,relevant_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,job_change
0,8949,city_103,0.920,Male,True,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,True
1,29725,city_40,0.776,Male,False,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,False
2,11561,city_21,0.624,NaN,False,Full time course,Graduate,STEM,5,NaN,NaN,never,83,False
3,33241,city_115,0.789,NaN,False,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,True
4,666,city_162,0.767,Male,True,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,False

In [5]:
# Filter students with 10 or more years experience at companies with at least 1000 employees
df_filtered = df[(df['experience'] >= '10') & (df['company_size'] >= '1000-4999')]
df_filtered.head()

,student_id,city,city_development_index,gender,relevant_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,job_change
9,699,city_103,0.920,NaN,True,no_enrollment,Graduate,STEM,17,10000+,Pvt Ltd,>4,123,False
12,25619,city_61,0.913,Male,True,no_enrollment,Graduate,STEM,>20,1000-4999,Pvt Ltd,3,23,False
31,22293,city_103,0.920,Male,True,Part time course,Graduate,STEM,19,5000-9999,Pvt Ltd,>4,141,False
34,26494,city_16,0.910,Male,True,no_enrollment,Graduate,Business Degree,12,5000-9999,Pvt Ltd,3,145,False
40,2547,city_114,0.926,Female,True,Full time course,Masters,STEM,16,1000-4999,Public Sector,2,14,False